# CommandEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CommandEventArgs Properties
CommandEventArgs Class See Also
---
The CommandEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ActiveDocument | The active document. |
| Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.  (Inherited from RevitEventArgs.) |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitEventArgs.) |
| CommandId | The command id. |

# See Also
CommandEventArgs Class
Autodesk.Revit.UI.Events Namespace